Repository: dotnet/maui
Catalog: src/Controls/src/SourceGen/xlf/MauiGResources.*.resx
Languages: de, es, fr, it, ja, ko, pl, ru, tr, zh_hans, zh_hant

# XamlParsingErrorMessage
source: An error occured while parsing Xaml: {0}.
de: Fehler beim Analysieren von XAML: {0}.
es: Error al analizar el Xaml: {0}.
fr: Une erreur s’est produite lors de l’analyse XAML : {0}.
it: Si è verificato un errore durante l'analisi di XAML: {0}.
ja: XAML の解析中にエラーが発生しました: {0}。
ko: Xaml: {0}을(를) 구문 분석하는 동안 오류가 발생했습니다.
pl: Wystąpił błąd podczas analizowania kodu Xaml: {0}.
ru: Произошла ошибка при синтаксическом анализе XAML: {0}.
tr: Xaml ayrıştırılırken bir hata oluştu: {0}.
zh_hans: 分析 Xaml 时出错： {0}。
zh_hant: 剖析 Xaml 時發生錯誤：{0}。

source: XAML parsing failed.
de: Fehler bei der XAML-Analyse
es: Error al analizar XAML
fr: L'analyse XAML a échoué
it: L'analisi XAML non è riuscita
ja: XAML の解析に失敗しました
ko: XAML 구문 분석 실패
pl: Analizowanie kodu XAML nie powiodło się
ru: Сбой синтаксического анализа XAML
tr: XAML ayrıştırılamadı
zh_hans: XAML 分析失败
zh_hant: XAML 剖析失敗

# ExpressionNotClosed
source: Expression must end with '}'.
de: Der Ausdruck muss mit „}“ enden.
es: La expresión debe terminar con "}".
fr: L'expression doit se terminer par '}'.
it: L'espressione deve terminare con '}'.
ja: 式の末尾は '}' にする必要があります。
ko: 식은 '}'(으)로 끝나야 합니다.
pl: Wyrażenie musi kończyć się wyrazem „}”.
ru: Выражение должно заканчиваться символом "}".
tr: İfade ‘}’ ile bitmelidir.
zh_hans: 表达式必须以 "}" 结尾。
zh_hant: 運算式必須以 '}' 結尾。

# RectConversionFailed
source: Cannot convert "{0}" into Rect, expected format is "x, y, w, h"
de: „{0}“ kann nicht in Rect konvertiert werden. Erwartetes Format: „x, y, w, h“
es: No se puede convertir "{0}" en Rect; el formato esperado es "x, y, w, h"
fr: Impossible de convertir « {0} » en Rect, le format attendu est « x, y, l, h »
it: Non è possibile convertire "{0}" in Rect; il formato previsto è "x, y, w, h".
ja: "{0}" を Rect に変換できません。想定される形式は "x, y, w, h" です
ko: "{0}"을(를) Rect로 변환할 수 없습니다. 필요한 형식은 "x, y, w, h"입니다.
pl: Nie można przekonwertować elementu „{0}” na wartość Rect. Oczekiwany format to „x, y, w, h”
ru: Не удается преобразовать "{0}" в Rect. Ожидаемый формат: "x, y, w, h"
tr: "{0}" Rect'e dönüştürülemiyor, beklenen biçim “x, y, w, h”
zh_hans: 无法将 "{0}" 转换为 Rect，格式应为 "x, y, w, h"
zh_hant: 無法將 "{0}" 轉換為 Rect，預期的格式為 "x, y, w, h"。

# ConversionFailed
source: Cannot convert "{0}" into "{1}".
de: „{0}“ kann nicht in „{1}“ konvertiert werden.
es: No se puede convertir "{0}" en "{1}".
fr: Impossible de convertir "{0}" en "{1}".
it: Non è possibile convertire "{0}" in "{1}".
ja: "{0}" を "{1}" に変換できません。
ko: "{0}"을(를) "{1}"(으)로 변환할 수 없습니다.
pl: Nie można przekonwertować wartości „{0}” na „{1}”.
ru: Не удается преобразовать "{0}" в "{1}".
tr: "{0}", "{1}" olarak dönüştürülemiyor.
zh_hans: 无法将 "{0}" 转换为 "{1}"。
zh_hant: 無法將 "{0}" 轉換為 "{1}"。

# PointConversionFailed
source: Cannot convert "{0}" into Point, expected format is "x, y".
de: „{0}“ kann nicht in Punkt konvertiert werden. Das erwartete Format ist „x, y“.
es: No se puede convertir "{0}" en Point, el formato esperado es "x, y".
fr: Impossible de convertir "{0}" en Point, le format attendu est "x, y".
it: Non è possibile convertire "{0}" in Point; il formato previsto è "x, y".
ja: "{0}" を Point に変換できません。想定される形式は "x, y" です。
ko: "{0}"을(를) Point로 변환할 수 없습니다. 필요한 형식은 "x, y"입니다.
pl: Nie można przekonwertować wartości „{0}” na wartość Punkt. Oczekiwany format to „x, y”.
ru: Не удается преобразовать "{0}" в Point. Ожидаемый формат: "x, y".
tr: "{0}", Point türüne dönüştürülemiyor, beklenen biçim “x, y”.
zh_hans: 无法将 "{0}" 转换为 Point，格式应为 "x, y"。
zh_hant: 無法將 "{0}" 轉換為 Point，預期的格式為 "x, y"。

# ThicknessConversionFailed
source: Cannot convert "{0}" into Thickness, expected format is "h, v" or "l, t, r, b" or "l".
de: „{0}“ kann nicht in „Thickness“ konvertiert werden. Das erwartete Format ist „h, v“ oder „l, t, r, b“ oder „l“.
es: No se puede convertir "{0}" en Thickness; el formato esperado es "h, v" o "l, t, r, b" o "l".
fr: Impossible de convertir "{0}" en épaisseur, le format attendu est "h, v" ou "l, t, r, b" ou "l".
it: Non è possibile convertire "{0}" in Thickness; il valore previsto è "h, v" or "l, t, r, b" o "l".
ja: "{0}" を Thickness に変換できません。必要な形式は "h, v"、"l, t, r b" または "l" です。
ko: "{0}"을(를) Thickness로 변환할 수 없습니다. 필요한 형식은 "h, v" 또는 "l, t, r, b" 또는 "l"입니다.
pl: Nie można przekonwertować wartości „{0}” na wartość Grubość. Oczekiwany format to "h, v" lub "l, t, r, b" lub "l".
ru: Не удается преобразовать "{0}" в Thickness. Ожидаемый формат: "h, v", "l, t, r, b" или "l".
tr: "{0}" Thickness’a dönüştürülemiyor, beklenen biçim “h, v” veya “l, t, r, b” veya “l”.
zh_hans: 无法将 "{0}" 转换为 Thickness，格式应为 "h, v"、"l, t, r, b" 或 "l"。
zh_hant: 無法將 "{0}" 轉換為 Thickness，預期的格式為 "h, v"、"l, t, r, b" 或 "l"。

# CornerRadiusConversionFailed
source: Cannot convert "{0}" into CornerRadius, expected format is "tl, tr, bl, br" or "l".
de: „{0}“ kann nicht in CornerRadius konvertiert werden. Das erwartete Format ist „tl, tr, bl, br“ oder „l“.
es: No se puede convertir "{0}" en CornerRadius; el formato esperado es "tl, tr, bl, br" o "l".
fr: Impossible de convertir "{0}" en CornerRadius, le format attendu est "tl, tr, bl, br" ou "l".
it: Non è possibile convertire "{0}" in CornerRadius; il valore previsto è "tl, tr, bl, br" o "l".
ja: "{0}" を CornerRadius に変換できません。想定される形式は "tl, tr, bl, br" または "l" です。
ko: "{0}"을(를) CornerRadius로 변환할 수 없습니다. 필요한 형식은 "tl, tr, bl, br" 또는 "l"입니다.
pl: Nie można przekonwertować wartości „{0}” na wartość CornerRadius. Oczekiwany format to „tl, tr, bl, br” lub „l”.
ru: Не удается преобразовать "{0}" в CornerRadius. Ожидаемый формат: "tl, tr, bl, br" или "l".
tr: "{0}" değerini CornerRadius'a dönüştürülemiyor, beklenen biçim "tl, tr, bl, br" veya "l".
zh_hans: 无法将 "{0}" 转换为 CornerRadius，格式应为 "tl, tr, bl, br" 或 "l"。
zh_hant: 無法將 "{0}" 轉換為 CornerRadius，預期的格式為 "tl, tr, bl, br" 或 "l"。

# SymbolResolution
source: Symbol resolution failed.
de: Fehler bei der Symbolauflösung
es: Error en la resolución de símbolos
fr: La résolution du symbole a échoué
it: Risoluzione dei simboli non riuscita
ja: シンボルの解決に失敗しました
ko: 기호 확인 실패
pl: Rozpoznawanie symboli nie powiodło się
ru: Сбой разрешения символов
tr: Sembol çözümlemesi başarısız oldu
zh_hans: 符号解析失败
zh_hant: 符號解析失敗

# TypeResolutionMessage
source: Cannot resolve type "{0}".
de: Der Typ „{0}“ kann nicht aufgelöst werden.
es: No se puede resolver el tipo "{0}".
fr: Impossible de résoudre le type « {0} ».
it: Non è possibile risolvere il tipo "{0}".
ja: 型 "{0}" を解決できません。
ko: 형식 "{0}"을(를) 확인할 수 없습니다.
pl: Nie można rozpoznać typu „{0}”.
ru: Не удается разрешить тип "{0}".
tr: "{0}" türü çözümlenemiyor.
zh_hans: 无法解析类型“{0}”。
zh_hant: 無法解析型別 "{0}"。

# DuplicateTypeError
source: Multiple Types found for "{0}".
de: Für „{0}“ wurden mehrere Typen gefunden.
es: Se encontraron varios tipos para "{0}".
fr: Plusieurs types trouvés pour « {0} ».
it: Sono stati trovati più tipi per "{0}".
ja: "{0}" に対して複数の型が見つかりました。
ko: "{0}"에 대해 여러 형식이 있습니다.
pl: Znaleziono wiele typów dla „{0}”.
ru: Найдено несколько типов для "{0}".
tr: "{0}" için birden çok Tür bulundu.
zh_hans: 找到 "{0}" 的多个类型。
zh_hant: 發現 "{0}" 有多個類型。

# MemberResolution
source: No accessible property, BindableProperty, or event found for "{0}", or mismatching type between value and property.
de: Für „{0}“ wurde keine Eigenschaft, keine BindableProperty oder kein Ereignis gefunden, oder es gibt eine Typdiskrepanz zwischen Wert und Eigenschaft.
es: No se encontró ninguna propiedad accesible, BindableProperty o evento para "{0}" o un tipo que no coincide entre el valor y la propiedad.
fr: Aucune propriété accessible, BindableProperty ou événement trouvé pour « {0} », ou type incompatible entre la valeur et la propriété.
it: Non sono stati trovati eventi, elementi BindableProperty o proprietà per "{0}" oppure il tipo di valore e la proprietà non corrispondono.
ja: アクセス可能なプロパティ、BindableProperty、または "{0}" のイベントが見つからないか、値とプロパティの型が一致しません。
ko: "{0}"에 대한 액세스 가능한 속성, BindableProperty 또는 이벤트가 없거나 값과 속성 간의 형식이 일치하지 않습니다.
pl: Nie znaleziono właściwości z ułatwieniami dostępu, właściwości BindableProperty ani zdarzenia dla elementu „{0}” lub niezgodności typu między wartością i właściwością.
ru: Не найдено доступное свойство, привязываемое свойство (BindableProperty) или событие для "{0}", либо типы значения и свойства не совпадают.
tr: “{0}” için erişilebilir özellik, BindableProperty veya olay bulunamadı veya değer ile özellik arasında uyumsuzluk var.
zh_hans: 未找到 "{0}" 的可访问属性、BindableProperty 或事件，或者值与属性之间的类型不匹配。
zh_hant: 找不到 "{0}" 的可存取屬性、BindableProperty 或事件，或值與屬性之間的類型不相符。

# EasingConversionFailed
source: Cannot convert "{0}" into Easing, expect value is "Linear", "SinOut", "SinIn", "SinInOut", "CubicIn", "CubicOut", "CubicInOut", "BounceOut", "BounceIn", "SpringIn" or "SpringOut".
de: „{0}“ kann nicht in Beschleunigung konvertiert werden. Erwartet wird der Wert „Linear“, „SinOut“, „SinIn“, „SinInOut“, „CubicIn“, „CubicOut“, „CubicInOut“, „BounceOut“, „BounceIn“, „SpringIn“ oder „SpringOut“.
es: No se puede convertir "{0}" en Easing; el valor esperado es "Linear", "SinOut", "SinIn", "SinInOut", "CubicIn", "CubicOut", "CubicInOut", "BounceOut", "BounceIn", "SpringIn" o "SpringOut".
fr: Impossible de convertir "{0}" en Easing, la valeur attendue est "Linear", "SinOut", "SinIn", "SinInOut", "CubicIn", "CubicOut", "CubicInOut", "BounceOut", "BounceIn", "SpringIn" ou "SpringOut".
it: Non è possibile convertire "{0}" in Easing; il valore previsto è "Linear", "SinOut", "SinIn", "SinInOut", "CubicIn", "CubicOut", "CubicInOut", "BounceOut", "BounceIn", "SpringIn" o "SpringOut".
ja: "{0}" を Easing に変換できません。想定される値は "Linear"、"SinOut"、"SinIn"、"SinInOut"、"CubicIn"、"CubicOut"、"CubicInOut"、"BounceOut"、"BounceIn"、"SpringIn"、または "SpringOut" です。
ko: "{0}"을(를) Easing으로 변환할 수 없습니다. 필요한 값은 "Linear", "SinOut", "SinIn", "SinInOut", "CubicIn", "CubicOut", "CubicInOut", "BounceOut", "BounceIn", "SpringIn" 또는 "SpringOut"입니다.
pl: Nie można przekonwertować wartości „{0}” na wartość Rozmycie. Oczekiwana wartość to „Linear”, „SinOut”, „SinIn”, „SinInOut”, „CubicIn”, „CubicInOut”, „BounceOut”, „BounceIn”, „SpringIn” lub „SpringOut”.
ru: Не удается преобразовать "{0}" в Easing, ожидается значение "Linear", "SinOut", "SinIn", "SinInOut", "CubicIn", "CubicOut", "CubicInOut", "BounceOut", "BounceIn", "SpringIn" или "SpringOut".
tr: "{0}" Easing'e dönüştürülemiyor, beklenen değer "Linear", "SinOut", "SinIn", "SinInOut", "CubicIn", "CubicOut", "CubicInOut", "BounceOut", "BounceIn", "SpringIn" veya "SpringOut".
zh_hans: 无法将 "{0}" 转换为 Easing，值应为 "Linear"、"SinOut"、"SinIn"、"SinInOut"、"CubicIn"、"CubicOut"、"CubicInOut"、"BounceOut"、"BounceIn"、"SpringIn" 或 "SpringOut"。
zh_hant: 無法將 "{0}" 轉換為 Easing，預期值為 "Linear"、"SinOut"、"SinIn"、"SinInOut"、"CubicIn"、"CubicOut"、"CubicInOut"、"BounceOut"、"BounceIn"、"SpringIn" 或 "SpringOut"。

# FlexBasisConversionFailed
source: Cannot convert "{0}" into FlexBasis, expected values are "Auto" or "n%", "n" where n is a numeric value.
de: „{0}“ kann nicht in FlexBasis konvertiert werden. Erwartete Werte sind „Auto“ oder „n%“, „n“, wobei n ein numerischer Wert ist.
es: No se puede convertir "{0}" en FlexBasis, los valores esperados son "Auto" o "n%", "n" donde n es un valor numérico.
fr: Impossible de convertir « {0} » en FlexBasis, les valeurs attendues sont « Auto » ou « n% », « n » où n est une valeur numérique.
it: Non è possibile convertire "{0}" in FlexBasis; i valori previsti sono "Auto" o "n%", "n" dove n è un valore numerico.
ja: "{0}" を FlexBasis に変換できません。想定される値は "Auto" または "n%"、"n" です。ここで n は数値です。
ko: "{0}"을(를) FlexBasis로 변환할 수 없습니다. 필요한 값은 "Auto" 또는 "n%", "n"입니다. 여기서 n은 숫자 값입니다.
pl: Nie można przekonwertować wartości „{0}” na wartość FlexBasis, Oczekiwane wartości to „Auto” lub „n%”, „n”, gdzie n jest wartością liczbową.
ru: Не удается преобразовать "{0}" в FlexBasis. Ожидаемые значения: "Auto" или "n%", где n — числовое значение.
tr: "{0}" değerini FlexBasis'e dönüştürülemiyor, beklenen değerler "Auto" veya "n%", "n" olup, n sayısal bir değerdir.
zh_hans: 无法将 "{0}" 转换为 FlexBasis，值应为 "Auto" 或 "n%"、"n"，其中 n 是数值。
zh_hant: 無法將 "{0}" 轉換為 FlexBasis，預期值為 "Auto" 或 "n%"，其中 n 是數值。

# FlowDirectionConversionFailed
source: Cannot convert "{0}" into FlowDirection, expected values are "rtl", "ltr", "inherit", "MatchParent", "LeftToRight" or "RightToLeft".
de: „{0}“ kann nicht in FlowDirection konvertiert werden. Erwartete Werte sind „rtl“, „ltr“, „inherit“, „MatchParent“, „LeftToRight“ oder „RightToLeft“.
es: No se puede convertir "{0}" en FlowDirection; los valores esperados son "rtl", "ltr", "inherit", "MatchParent", "LeftToRight" o "RightToLeft".
fr: Impossible de convertir "{0}" en FlowDirection, les valeurs attendues sont "rtl", "ltr", "inherit", "MatchParent", "LeftToRight" ou "RightToLeft".
it: Non è possibile convertire "{0}" in FlowDirection, i valori previsti sono "rtl", "ltr", "inherit", "MatchParent", "LeftToRight" o "RightToLeft".
ja: "{0}" を FlowDirection に変換できません。想定される値は "rtl"、"ltr"、"inherit"、"MatchParent"、"LeftToRight"、または "RightToLeft" です。
ko: "{0}"을(를) FlowDirection으로 변환할 수 없습니다. 필요한 값은 "rtl", "ltr", "inherit", "MatchParent", "LeftToRight" 또는 "RightToLeft"입니다.
pl: Nie można przekonwertować wartości „{0}” na wartość FlowDirection, Oczekiwane wartości to „rtl”, „ltr”, „inherit”, „MatchParent”, „LeftToRight” lub „RightToLeft”.
ru: Не удается преобразовать "{0}" в FlowDirection. Ожидаемые значения: "rtl", "ltr", "inherit", "MatchParent", "LeftToRight" или "RightToLeft".
tr: "{0}" FlowDirection'a dönüştürülemiyor, beklenen değerler "rtl", "ltr", "inherit", "MatchParent", "LeftToRight" veya "RightToLeft".
zh_hans: 无法将 "{0}" 转换为 FlowDirection，值应为 "rtl"、"ltr"、"inherit"、"MatchParent"、"LeftToRight" 或 "RightToLeft"。
zh_hant: 無法將 "{0}" 轉換為 FlowDirection，預期值為 "rtl"、"ltr"、"inherit"、"MatchParent"、"LeftToRight" 或 "RightToLeft".

# GridLengthConversionFailed
source: Cannot convert "{0}" into GridLength, expected values are "*", "n*", "Auto" or "n" where n is a numeric value.
de: „{0}“ kann nicht in GridLength konvertiert werden. Erwartete Werte sind „*“, „n*“, „Auto“ oder „n“, wobei n ein numerischer Wert ist.
es: No se puede convertir "{0}" en GridLength, los valores esperados son "*", "n*", "Auto" o "n", donde n es un valor numérico.
fr: Impossible de convertir "{0}" en GridLength, les valeurs attendues sont "*", "n*", "Auto" ou "n" où n est une valeur numérique.
it: Non è possibile convertire "{0}" in GridLength; i valori previsti sono "*", "n*", "Auto" o "n" dove n è un valore numerico.
ja: "{0}" を GridLength に変換できません。想定される値は "*"、"n*"、"Auto"、または "n" です。ここで n は数値です。
ko: "{0}"을(를) GridLength로 변환할 수 없습니다. 필요한 값은 "*", "n*", "Auto" 또는 "n"입니다. 여기서 n은 숫자 값입니다.
pl: Nie można przekonwertować wartości „{0}” na wartość GridLength. Oczekiwane wartości to „*”, „n*”, „Auto” lub „n”, gdzie n jest wartością liczbową.
ru: Не удается преобразовать "{0}" в GridLength. Ожидаемые значения: "*", "n*", "Auto" или "n", где n — числовое значение.
tr: "{0}" GridLength'e dönüştürülemiyor, beklenen değerler "*", "n*", "Auto" veya "n" olup, n sayısal bir değerdir.
zh_hans: 无法将 "{0}" 转换为 GridLength，值应为 "*"、"n*"、"Auto" 或 "n"，其中 n 是数值。
zh_hant: 無法將 "{0}" 轉換為 GridLength，預期值為 "*"、"n*"、"Auto" 或 "n"，其中 n 是數值。

# ListStringConversionFailed
source: Cannot convert "{0}" into List<string>, expected format is "x, y, z".
de: „{0}“ kann nicht in List<string> konvertiert werden. Das erwartete Format ist „x, y, z“.
es: No se puede convertir "{0}" en List<string>, el formato esperado es "x, y, z".
fr: Impossible de convertir "{0}" en List<string>, le format attendu est "x, y, z".
it: Non è possibile convertire "{0}" in List<string>; il formato previsto è "x, y, z".
ja: "{0}" を List<string> に変換できません。必要な形式は "x, y, z" です。
ko: "{0}"을(를) List<string>(으)로 변환할 수 없습니다. 필요한 형식은 "x, y, z"입니다.
pl: Nie można przekonwertować wartości „{0}” na wartość Lista<ciąg>. Oczekiwany format to „x, y, z”.
ru: Не удается преобразовать "{0}" в List<string>. Ожидаемый формат: "x, y, z".
tr: "{0}" List<string>'e dönüştürülemiyor, beklenen biçim “x, y, z”.
zh_hans: 无法将 "{0}" 转换为 List<string>，格式应为 "x, y, z"。
zh_hant: 無法將 "{0}" 轉換為 List<string>，預期的格式為 "x, y, z"。

# StrokeShapeConversionFailed
source: Cannot convert "{0}" into Shape (or descendant).
de: „{0}“ kann nicht in Form (oder Nachfolger) konvertiert werden.
es: No se puede convertir "{0}" en Shape (o descendant).
fr: Impossible de convertir "{0}" en forme (ou descendant).
it: Non è possibile convertire "{0}" in Shape (o un discendente).
ja: "{0}" を Shape (または子孫) に変換できません。
ko: "{0}"을(를) 도형(또는 하위 항목)으로 변환할 수 없습니다.
pl: Nie można przekonwertować wartości „{0}” na wartość Kształt (lub element podrzędny).
ru: Не удается преобразовать "{0}" в Shape (или в потомка).
tr: "{0}" Shape (veya alt öğesi) olarak dönüştürülemiyor.
zh_hans: 无法将 "{0}" 转换为 Shape (或其后代)。
zh_hant: 無法將 "{0}" 轉換成 Shape (或子系)。

# ColumnDefinitionCollectionConversionFailed
source: Cannot convert "{0}" into ColumnDefinitionCollection, expected values are "*", "n*", "Auto", or "n" (or a combination of these seperated by commas) where n is a numeric value.
de: „{0}“ kann nicht in ColumnDefinitionCollection konvertiert werden. Erwartete Werte sind „*“, „n*“, „Auto“ oder „n“ (oder eine Kombination dieser durch Kommas getrennten Werte), wobei n ein numerischer Wert ist.
es: No se puede convertir "{0}" en ColumnDefinitionCollection; los valores esperados son "*", "n*", "Auto" o "n" (o una combinación de estos separados por comas) donde n es un valor numérico.
fr: Impossible de convertir « {0} » en ColumnDefinitionCollection, les valeurs attendues sont « * », « n* », « Auto » ou « n » (ou une combinaison de ces éléments séparés par des virgules) où n est une valeur numérique.
it: Non è possibile convertire "{0}" in ColumnDefinitionCollection; i valori previsti sono "*", "n*", "Auto" or "n" (o una combinazione di questi valori delimitati da virgole) dove n è un valore numerico.
ja: "{0}" を ColumnDefinitionCollection に変換できません。想定される値は "*"、"n*"、"Auto"、または "n" (またはコンマで区切られたこれらの組み合わせ) です。ここで n は数値です。
ko: "{0}"을(를) ColumnDefinitionCollection으로 변환할 수 없습니다. 필요한 값은 "*", "n*", "Auto" 또는 "n"(쉼표로 구분된 조합 가능)이며, 여기서 n은 숫자입니다.
pl: Nie można przekonwertować wartości „{0}” na wartość ColumnDefinitionCollection. Oczekiwane wartości to „*”, „n*”, „Auto” lub „n” (lub kombinacja tych oddzielonych przecinkami), gdzie n jest wartością liczbową.
ru: Не удается преобразовать "{0}" в ColumnDefinitionCollection. Ожидаемые значения: "*", "n*", "Auto" или "n" (или их сочетание, разделенное запятыми), где n — числовое значение.
tr: "{0}" ColumnDefinitionCollection'a dönüştürülemiyor, beklenen değerler "*", "n*", "Auto" veya "n" (veya bunlar virgülle ayrılmış bir bileşimi) olup, n sayısal bir değerdir.
zh_hans: 无法将 "{0}" 转换为 ColumnDefinitionCollection，值应为 "*"、"n*"、"Auto" 或 "n" (或由逗号分隔的组合)，其中 n 是数值。
zh_hant: 無法將 "{0}" 轉換為 ColumnDefinitionCollection，預期值為 "*"、"n*"、"Auto" 或 "n" (或這些以逗號分隔的值組合)，其中 n 是數值。

# RowDefinitionCollectionConversionFailed
source: Cannot convert "{0}" into RowDefinitionCollection, expected values are "*", "n*", "Auto", or "n" (or a combination of these seperated by commas) where n is a numeric value.
de: „{0}“ kann nicht in RowDefinitionCollection konvertiert werden. Erwartete Werte sind „*“, „n*“, „Auto“ oder „n“ (oder eine Kombination dieser durch Kommas getrennten Werte), wobei n ein numerischer Wert ist.
es: No se puede convertir "{0}" en RowDefinitionCollection; los valores esperados son "*", "n*", "Auto" o "n" (o una combinación de estos separados por comas) donde n es un valor numérico.
fr: Impossible de convertir « {0} » en RowDefinitionCollection, les valeurs attendues sont « * », « n* », « Auto » ou « n » (ou une combinaison de ces valeurs séparées par des virgules) où n est une valeur numérique.
it: Non è possibile convertire "{0}" in RowDefinitionCollection; i valori previsti sono "*", "n*", "Auto" o "n" (o una combinazione di questi valori delimitati da virgole) dove n è un valore numerico.
ja: "{0}" を RowDefinitionCollection に変換できません。想定される値は "*", "n*", "Auto", または "n" (もしくはこれらをカンマで区切った組み合わせ) であり、ここで n は数値です。
ko: "{0}"을(를) RowDefinitionCollection으로 변환할 수 없습니다. 필요한 값은 "*", "n*", "Auto" 또는 "n"(또는 쉼표로 구분된 값의 조합)입니다. 여기서 n은 숫자 값입니다.
pl: Nie można przekonwertować wartości „{0}” na kolekcję RowDefinitionCollection. Oczekiwane wartości to „*”, „n*”, „Auto” lub „n” (lub kombinacja tych oddzielonych przecinkami), gdzie n jest wartością liczbową.
ru: Не удается преобразовать "{0}" в RowDefinitionCollection. Ожидаемые значения: "*", "n*", "Auto" или "n" (или их сочетание, разделенное запятыми), где n — числовое значение.
tr: "{0}" RowDefinitionCollection'a dönüştürülemiyor, beklenen değerler "*", "n*", "Auto" veya "n" (veya bunlar virgülle ayrılmış bir bileşimi) olup, burada n sayısal bir değerdir.
zh_hans: 无法将 "{0}" 转换为 RowDefinitionCollection，值应为 "*"、"n*"、"Auto" 或 "n" (或由逗号分隔的组合)，其中 n 是数值。
zh_hant: 無法將 "{0}" 轉換為 RowDefinitionCollection，預期值為 "*"、"n*"、"Auto" 或 "n" (或這些以逗號分隔的值組合)，其中 n 是數值。

# LayoutOptionsConversionFailed
source: Cannot convert "{0}" into LayoutOptions, expected values are "Start", "Center, "End" or "Fill".
de: „{0}“ kann nicht in LayoutOptions konvertiert werden. Erwartete Werte sind „Start“, „Center“, „End“ oder „Fill“.
es: No se puede convertir "{0}" en LayoutOptions; los valores esperados son "Start", "Center, "End" o "Fill".
fr: Impossible de convertir « {0} » en LayoutOptions, les valeurs attendues sont « Début », « Centre », « Fin » ou « Remplissage ».
it: Non è possibile convertire "{0}" in LayoutOptions; il valore previsto è "Start", "Center, "End" o "Fill".
ja: "{0}" を LayoutOptions に変換できません。想定される値は "Start"、"Center"、"End"、または "Fill" です。
ko: "{0}"을(를) LayoutOptions로 변환할 수 없습니다. 필요한 값은 "Start", "Center, "End" 또는 "Fill"입니다.
pl: Nie można przekonwertować wartości „{0}” na LayoutOptions, oczekiwane wartości to „Start”, „Center, „End” lub „Fill”.
ru: Не удается преобразовать "{0}" в LayoutOptions. Ожидаемые значения: "Start", "Center", "End" или "Fill".
tr: "{0}" LayoutOptions'a dönüştürülemiyor, beklenen değerler "Start", "Center", "End" veya "Fill".
zh_hans: 无法将 "{0}" 转换为 LayoutOptions，值应为 "Start"、"Center"、"End" 或 "Fill"。
zh_hant: 無法將 "{0}" 轉換為 LayoutOptions，預期值為 "Start"、"Center、"End" 或 "Fill"。

# MethodResolution
source: No method found for '{0}'.
de: Für „{0}“ wurde keine Methode gefunden.
es: No se encontró ningún método para "{0}".
fr: Aucune méthode trouvée pour '{0}'.
it: Nessun metodo trovato per '{0}'.
ja: '{0}' のメソッドが見つかりませんでした。
ko: '{0}'에 대한 메서드를 찾을 수 없습니다.
pl: Nie znaleziono metody dla „{0}”.
ru: Не найден метод для "{0}".
tr: '{0}' için metot bulunamadı.
zh_hans: 找不到 "{0}" 的方法。
zh_hant: 找不到 '{0}' 的方法。

# DuplicateKeyInRD
source: duplicate key in resource dictionary
de: Doppelter Schlüssel im Ressourcenwörterbuch
es: clave duplicada en el diccionario de recursos
fr: clé en double dans le dictionnaire de ressources
it: chiave duplicata nel dizionario risorse
ja: リソース ディクショナリ内の重複するキー
ko: 리소스 사전의 중복 키
pl: zduplikowany klucz w słowniku zasobów
ru: повторяющийся ключ в словаре ресурсов
tr: kaynak sözlüğünde yinelenen anahtar
zh_hans: 资源字典中的重复键
zh_hant: 資源字典中的重複索引鍵

# ConversionFailedTitle
source: Conversion Failed
de: Fehler bei der Konvertierung
es: No se pudo realizar la conversión
fr: Échec de la conversion
it: Conversione non riuscita
ja: 変換が失敗しました
ko: 변환 실패
pl: Konwersja nie powiodła się
ru: Сбой преобразования
tr: Dönüştürme Başarısız Oldu
zh_hans: 转换失败
zh_hant: 轉換失敗
