Repository: dotnet/maui
Catalog: src/Controls/src/Build.Tasks/xlf/ErrorMessages.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# StyleSheetSourceOrContent
source: StyleSheet cannot have both a Source and a content.
cs: Šablona stylů nemůže obsahovat jak zdroj, tak obsah.
de: Das StyleSheet kann nicht gleichzeitig eine Source-Eigenschaft und einen Inhalt aufweisen.
es: StyleSheet no puede tener un origen y un contenido.
fr: StyleSheet ne peut pas avoir à la fois Source et un contenu.
it: Un elemento StyleSheet non può includere sia un elemento Source che contenuto.
ja: スタイルシートにソースとコンテンツの両方を含めることはできません。
ko: 스타일 시트는 소스와 콘텐츠 중 하나만 포함할 수 있습니다.
pl: Arkusz stylów nie może mieć zarówno źródła, jak i zawartości.
pt_br: A StyleSheet não pode ter uma Origem e também um conteúdo.
ru: Таблица стилей (StyleSheet) не может одновременно содержать источник (Source) и содержимое.
tr: StyleSheet, hem Source hem de içerik bulunduramaz.
zh_hans: 样式表不能同时具有源和内容。
zh_hant: 樣式表不能同時有來源和內容。

# StyleSheetStyleNotALiteral
source: Style property or Content is not a string literal.
cs: Vlastnost Style nebo obsah není řetězcový literál.
de: Die Style-Eigenschaft oder der Inhalt ist kein Zeichenfolgenliteral.
es: La propiedad Style o Content no es un literal de cadena.
fr: La propriété Style ou le contenu n'est pas un littéral de chaîne.
it: La proprietà Style o l'elemento Content non è un valore letterale stringa.
ja: スタイル プロパティまたはコンテンツが文字列リテラルではありません。
ko: 스타일 속성 또는 콘텐츠가 문자열 리터럴이 아닙니다.
pl: Zawartość lub właściwość stylu nie jest literałem ciągu.
pt_br: A propriedade ou o Conteúdo de Estilo não é um literal de cadeia de caracteres.
ru: Свойство Style или содержимое (Content) не является строковым литералом.
tr: Style özelliği veya Content bir dize sabit değeri değil.
zh_hans: 样式属性或内容不是字符串文本。
zh_hant: 樣式屬性或內容不是字串常值。

# TypeResolution
source: Cannot resolve type "{0}".
cs: Typ {0} nejde přeložit.
de: Der Typ "{0}" kann nicht aufgelöst werden.
es: No se puede resolver el tipo "{0}".
fr: Impossible de résoudre le type "{0}".
it: Non è possibile risolvere il tipo "{0}".
ja: 型 "{0}" を解決できません。
ko: 형식 "{0}"을(를) 확인할 수 없습니다.
pl: Nie można rozpoznać typu „{0}”.
pt_br: Não é possível resolver o tipo "{0}".
ru: Не удается разрешить тип "{0}".
tr: "{0}" türü çözümlenemiyor.
zh_hans: 无法解析类型“{0}”。
zh_hant: 無法解析型別 "{0}"。

# XDataTypeSyntax
source: x:DataType expects a string literal, an {{x:Type}} markup or {{x:Null}}.
cs: x:DataType očekává řetězcový literál, značku {{x:Type}} nebo {{x:Null}}.
de: x:DataType erwartet ein Zeichenfolgenliteral, ein {{x:Type}}-Markup oder {{x:Null}}.
es: x:DataType espera un literal de cadena, una marca {{x:Type}} o {{x:Null}}.
fr: x:DataType attend un littéral de chaîne, une balise {{x:Type}} ou {{x:Null}}.
it: Con x:DataType è previsto un valore letterale stringa, un markup {{x:Type}} oppure {{x:Null}}.
ja: x:DataType には、文字列リテラル、{{x:Type}} マークアップ、または {{x:Null}} を指定する必要があります。
ko: x:DataType에는 {{x:Type}} 태그 또는 {{x:Null}} 문자열 리터럴이 필요합니다.
pl: Argument x:DataType oczekuje literału ciągu, znacznika {{x:Type}} lub {{x:Null}}.
pt_br: O x:DataType espera um literal de cadeia de caracteres, uma marcação {{x:Type}} ou um {{x:Null}}.
ru: x:DataType ожидает строковый литерал, разметку {{x:Type}} или {{x:Null}}.
tr: x:DataType için bir dize sabit değeri, {{x:Type}} işaretlemesi veya {{x:Null}} bekleniyor.
zh_hans: x:DataType 需要字符串文本、{{x:Type}} 标记或 {{x:Null}}。
zh_hant: x:DataType 需要字串常值、{{x:Type}} 標記或 {{x:Null}}。

# XStaticResolution
source: x:Static: unable to find a public -- or accessible internal -- static field, static property, const or enum value named "{0}" in "{1}".
cs: x:Static: nejde najít veřejné nebo přístupné interní statické pole, statickou vlastnost, konstantu nebo hodnotu výčtu s názvem {0} v typu {1}.
de: x:Static: Ein öffentliches – oder zugängliches internes – statisches Feld, eine statische Eigenschaft oder ein const- oder enum-Wert mit dem Namen "{0}" wurde in "{1}" nicht gefunden.
es: x:Static: no puede encontrar un campo estático público (o interno accesible), una propiedad estática o un valor constante o de enumeración llamados "{0}" en "{1}".
fr: x:Static : impossible de localiser un champ statique public (ou interne et accessible), une propriété statique, une valeur const ou une valeur enum portant le nom "{0}" dans "{1}".
it: x:Static: non è possibile trovare un valore di campo statico pubblico o interno accessibile, di proprietà statica, di costante o di enumerazione denominato "{0}" in "{1}".
ja: x:Static: "{1}" に、"{0}" という名前のパブリックな (またはアクセス可能な内部の) 静的フィールド、静的プロパティ、const、または列挙値が見つかりません。
ko: x:Static: "{1}"에서 이름이 "{0}"인 public 또는 액세스 가능한 내부 정적 필드, 정적 속성, 상수 또는 열거형 값을 찾을 수 없습니다.
pl: x:Static: nie można odnaleźć publicznego — lub dostępnego wewnętrznie — pola statycznego, właściwości statycznej, stałej lub wartości wyliczenia o nazwie „{0}” w typie „{1}”.
pt_br: O x:Static: não pôde encontrar um campo estático, uma propriedade estática, um valor const ou enumerado público (ou interno acessível) denominado "{0}" em "{1}".
ru: x:Static: не удается найти статическое поле, статическое свойство, константу или значение перечисления с именем "{0}" в "{1}", которые являлись бы открытыми или были бы доступны внутренне.
tr: x:Static: "{1}" içinde "{0}" adlı genel -- veya erişilebilir, dahili -- statik alan, statik özellik, sabit veya sabit listesi değeri bulunamıyor.
zh_hans: x:Static: 在“{1}”中找不到公共(或可访问的内部)静态字段、静态属性、常量或枚举值“{0}”。
zh_hant: x:Static: 在 "{1}" 中找不到名為 "{0}" 的公用 (或可存取內部) 靜態欄位、靜態屬性、常數或列舉值。

# XStaticSyntax
source: Syntax for x:Static is "[Member=][prefix:]typeName.staticMemberName".
cs: Syntaxe pro x:Static je [Člen=][předpona:]názevTypu.názevStatickéhoČlenu.
de: Die Syntax für "x:Static" lautet "[Member=][prefix:]typeName.staticMemberName".
es: La sintaxis de x:Static es "[Member=][prefix:]typeName.staticMemberName".
fr: La syntaxe de x:Static est "[Member=][prefix:]typeName.staticMemberName".
it: La sintassi di x:Static è "[Membro=][prefisso:]nomeTipo.nomeMembroStatico".
ja: X:Static の構文が、"[Member=][prefix:]typeName.staticMemberName" です。
ko: X:Static에 대한 구문은 "[Member=][prefix:]typeName.staticMemberName"입니다.
pl: Składnia elementu x:Static to „[elementCzłonkowski=][prefiks:]nazwaTypu.nazwaStatycznegoElementuCzłonkowskiego”.
pt_br: A sintaxe de x:Static é "[Member=][prefix:]typeName.staticMemberName".
ru: Синтаксис для x:Static — "[Member=][prefix:]typeName.staticMemberName".
tr: x:Static için söz dizimi "[Member=][önek:]türAdı.statikÜyeAdı" şeklindedir.
zh_hans: x:Static 的语法为 "[Member=][prefix:]typeName.staticMemberName"。
zh_hant: x:Static 的語法為 "[Member=][prefix:]typeName.staticMemberName"。

# XmlnsUndeclared
source: Undeclared xmlns prefix "{0}".
cs: Nedeklarovaná předpona xmlns: {0}
de: Nicht deklariertes xmlns-Präfix "{0}".
es: Prefijo xmlns no declarado "{0}".
fr: Préfixe xmlns non déclaré "{0}".
it: Il prefisso xmlns "{0}" non è dichiarato.
ja: 宣言されていない xmlns プレフィックス "{0}" です。
ko: 선언되지 않은 xmlns 접두사 "{0}"입니다.
pl: Niezadeklarowany prefiks xmlns „{0}”.
pt_br: Prefixo xmlns não declarado "{0}".
ru: Необъявленный префикс xmlns "{0}".
tr: "{0}" xmlns ön eki bildirilmedi.
zh_hans: xmlns 前缀“{0}”未经过声明。
zh_hant: 未宣告的 xmlns 前置詞 "{0}"。
