Repository: dotnet/maui
Catalog: src/Controls/src/Build.Tasks/xlf/ErrorMessages.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AdderMissing
source: No Add() method defined on "{0}{1}".
cs: Pro {0}{1} není nadefinovaná žádná metoda Add().
de: Für "{0}{1}" wurde keine Add()-Methode definiert.
es: No se ha definido ningún método Add() en "{0}{1}".
fr: Aucune méthode Add() définie sur "{0}{1}".
it: Non è stato definito alcun metodo Add() in "{0}{1}".
ja: Add() メソッドが "{0}{1}" に定義されていません。
ko: "{0}{1}"에 대한 Add() 메서드가 정의되지 않았습니다.
pl: Nie zdefiniowano metody Add() dla elementu „{0}{1}”.
pt_br: Não foi definido nenhum método Add() em "{0}{1}".
ru: Для "{0}{1}" не определен метод Add ().
tr: "{0}{1}" üzerinde Add() metodu tanımlanmadı.
zh_hans: 未在“{0}{1}”上定义 Add() 方法。
zh_hant: 在 "{0}{1}" 上未定義任何 Add() 方法。

# BPMissingGetter
source: Missing a "public static Get{0}" method or a public instance property getter for the attached property "{1}.{0}Property".
cs: Chybí veřejná statická metoda Get{0} nebo metoda getter veřejné vlastnosti instance pro připojenou vlastnost {1}.{0}Property.
de: Es fehlt eine Methode "public static Get{0}" oder ein Eigenschaftengetter der öffentlichen Instanz für die angefügte Eigenschaft "{1}.{0}Property".
es: Falta un método "public static Get{0}" o un captador de propiedad de instancia pública para la propiedad adjunta "{1}.{0}Property".
fr: Il manque une méthode "public static Get{0}" ou un getter de propriété d'instance publique pour la propriété jointe "{1}.{0}Property".
it: Manca un metodo "public static Get{0}" o un getter di proprietà di istanza pubblica per la proprietà associata "{1}.{0}Property".
ja: 添付プロパティ "{1}. {0}Property" の "public static Get{0}" メソッドまたはパブリック インスタンス プロパティ ゲッターがありません。
ko: 연결된 속성 "{1}.{0}Property"에 대한 "public static Get{0}" 메서드나 public 인스턴스 속성 getter가 없습니다.
pl: Brak metody „public static get{0}” lub metody pobierającej właściwość wystąpienia publicznego dla dołączonej właściwości „{1}.{0}Property”.
pt_br: Um método "public static Get{0}" ou um getter de propriedade de instância pública está ausente da propriedade anexada "{1}.{0}Property".
ru: Отсутствует метод "public static Get{0}" или метод получения открытого свойства экземпляра для вложенного свойства "{1}.{0}Property".
tr: "{1}.{0}Property" iliştirilmiş özelliği için "public static Get{0}" metodu veya genel örnek özellik alıcısı eksik.
zh_hans: 对于附加属性 "{1}.{0}Property"，缺少 "public static Get{0}" 方法或公共实例属性 getter。
zh_hant: 缺少附加屬性 "{1}.{0}Property" 的 "public static Get{0}" 方法或公用執行個體屬性 getter。

# BPName
source: The name of the BindableProperty {0} does not end with "Property".
cs: Název vlastnosti {0} typu BindableProperty nekončí na Property.
de: Der Name der BindableProperty "{0}" endet nicht mit "Property".
es: El nombre de BindableProperty {0} no termina con "Property".
fr: Le nom du BindableProperty {0} ne finit pas par "Property".
it: Il nome dell'elemento BindableProperty {0} non termina con "Property".
ja: BindableProperty {0} の名前の末尾が "Property" ではありません。
ko: BindableProperty {0}의 이름은 "Property"로 끝나지 않습니다.
pl: Nazwa właściwości BindableProperty {0} nie kończy się ciągiem „Property”.
pt_br: O nome da BindableProperty {0} não termina com "Property".
ru: Имя привязываемого свойства (BindableProperty) {0} не заканчивается на "Property".
tr: {0} BindableProperty adı "Property" ile bitmiyor.
zh_hans: BindableProperty {0} 的名称不是以 "Property" 结尾的。
zh_hant: BindableProperty {0} 的名稱不是以 "Property" 結尾。

# BindingIndexerEmpty
source: Binding: Indexer did not contain arguments.
cs: Vazba: Indexer neobsahoval argumenty.
de: Bindung: Der Indexer enthielt keine Argumente.
es: Enlace: el indizador no contenía argumentos.
fr: Liaison : l'indexeur ne contient pas d'arguments.
it: Associazione: l'indicizzatore non contiene argomenti.
ja: バインド: インデクサーに引数が含まれていませんでした。
ko: 바인딩: 인덱서에 인수가 없습니다.
pl: Powiązanie: indeksator nie zawierał argumentów.
pt_br: Associação: o indexador não continha nenhum argumento.
ru: Привязка: индексатор не содержит аргументов.
tr: Bağlama: Dizin oluşturucu bağımsız değişken içermiyordu.
zh_hans: 绑定: 索引器未包含参数。
zh_hant: 繫結: 索引子未包含引數。

# BindingIndexerNotClosed
source: Binding: Indexer did not contain closing bracket.
cs: Vazba: Indexer neobsahoval pravou hranatou závorku.
de: Bindung: Der Indexer enthielt keine schließende Klammer.
es: Enlace: el indizador no contenía un corchete de cierre.
fr: Liaison : l'indexeur ne contient pas de crochet fermant.
it: Associazione: l'indicizzatore non contiene la parentesi quadra di chiusura.
ja: バインド: インデクサーに右角かっこが含まれていませんでした。
ko: 바인딩: 인덱서에 닫는 대괄호가 없습니다.
pl: Powiązanie: indeksator nie zawierał nawiasu zamykającego.
pt_br: Associação: o indexador não continha nenhum colchete de fechamento.
ru: Привязка: индексатор не содержит закрывающей скобки.
tr: Bağlama: Dizin oluşturucu kapatma köşeli ayracı içermiyordu.
zh_hans: 绑定: 索引器未包含右方括号。
zh_hant: 繫結: 索引子未包含右中括弧。

# BindingIndexerParse
source: Binding: "{0}" cannot be parsed as an index for a "{1}".
cs: Vazba: {0} nejde analyzovat jako index pro vlastnost {1}.
de: Bindung: "{0}" kann nicht als Index für "{1}" analysiert werden.
es: Enlace: no se puede analizar "{0}" como un índice para "{1}".
fr: Liaison : "{0}" ne peut pas être analysé en tant qu'index pour "{1}".
it: Associazione: non è possibile analizzare "{0}" come indice di una proprietà "{1}".
ja: バインド: "{0}" は、"{1}" のインデックスとして解析できません。
ko: 바인딩: "{0}"을(를) "{1}"의 인덱스로 구문 분석할 수 없습니다.
pl: Powiązanie: nie można przeanalizować wartości „{0}” jako indeksu dla właściwości „{1}”.
pt_br: Associação: não é possível analisar "{0}" como um índice de uma "{1}".
ru: Привязка: не удается проанализировать значение индексатора "{0}" как индекс для свойства "{1}".
tr: Bağlama: "{0}", "{1}" için dizin olarak ayrıştırılamıyor.
zh_hans: 绑定: 无法将“{0}”作为“{1}”的索引进行分析。
zh_hant: 繫結: "{0}" 無法剖析為 "{1}" 的索引。

# BindingIndexerTypeUnsupported
source: Binding: Unsupported indexer index type: "{0}".
cs: Vazba: Nepodporovaný typ indexu indexeru: {0}
de: Binding: nicht unterstützter Indexer-Indextyp: "{0}".
es: Enlace: tipo de índice del indizador no admitido: "{0}".
fr: Liaison : type d'index d'indexeur non pris en charge : "{0}".
it: Associazione: il tipo di indice "{0}" dell'indicizzatore non è supportato.
ja: バインド: サポートされていない種類のインデクサーのインデックスです: "{0}"。
ko: 바인딩: 지원되지 않는 인덱서 인덱스 형식: "{0}"
pl: Powiązanie: nieobsługiwany typ indeksu indeksatora: „{0}”.
pt_br: Associação: tipo de índice do indexador sem suporte: "{0}".
ru: Привязка: неподдерживаемый тип индекса индексатора: "{0}".
tr: Bağlama: "{0}" dizin oluşturucu dizin türü desteklenmiyor.
zh_hans: 绑定: 不受支持的索引器索引类型:“{0}”。
zh_hant: 繫結: 不支援的索引子索引類型: "{0}"。

# BindingPropertyNotFound
source: Binding: Property "{0}" not found on "{1}".
cs: Vazba: Vlastnost {0} nejde u typu {1} najít.
de: Bindung: Die Eigenschaft "{0}" wurde in "{1}" nicht gefunden.
es: Enlace: no se encontró la propiedad "{0}" en "{1}".
fr: Liaison : propriété "{0}" introuvable sur "{1}".
it: Associazione: la proprietà "{0}" non è stata trovata in "{1}".
ja: バインド: プロパティ "{0}" が "{1}" に見つかりません。
ko: 바인딩: "{1}"에서 "{0}" 속성을 찾을 수 없습니다.
pl: Powiązanie: nie znaleziono właściwości „{0}” w typie „{1}”.
pt_br: Associação: a propriedade "{0}" não foi encontrada em "{1}".
ru: Привязка: свойство "{0}" не найдено в "{1}".
tr: Bağlama: "{1}" üzerinde "{0}" özelliği bulunamadı.
zh_hans: 绑定: 在“{1}”上找不到属性“{0}”。
zh_hant: 繫結: 在 "{1}" 上找不到屬性 "{0}"。

# ConstructorDefaultMissing
source: Missing default constructor for "{0}".
cs: Chybí výchozí konstruktor pro typ {0}.
de: Fehlender Standardkonstruktor für "{0}".
es: Falta el constructor predeterminado para "{0}".
fr: Constructeur par défaut manquant pour "{0}".
it: Manca il costruttore predefinito per "{0}".
ja: "{0}" の既定のコンストラクターがありません。
ko: "{0}"에 대한 기본 생성자가 없습니다.
pl: Brak domyślnego konstruktora dla typu „{0}”.
pt_br: Construtor padrão ausente de "{0}".
ru: Отсутствует конструктор по умолчанию для "{0}".
tr: "{0}" için varsayılan oluşturucu eksik.
zh_hans: 缺少“{0}”的默认构造函数。
zh_hant: 缺少 "{0}" 的預設建構函式。

# ConstructorXArgsMissing
source: Missing constructor for "{0}" with matching x:Arguments.
cs: Chybí konstruktor pro typ {0} s odpovídajícím atributem x:Arguments.
de: Fehlender Konstruktor für "{0}" mit übereinstimmendem Attribut "x:Arguments".
es: Falta un constructor para "{0}" con x:Arguments coincidentes.
fr: Constructeur manquant pour "{0}" avec un x:Arguments correspondant.
it: Manca il costruttore per "{0}" con attributo x:Arguments corrispondente.
ja: 一致する x:Arguments を持つ "{0}" のコンストラクターがありません。
ko: 일치하는 x:Arguments가 있는 "{0}"에 대한 생성자가 없습니다.
pl: Brak konstruktora dla typu „{0}” z pasującym atrybutem x:Arguments.
pt_br: Construtor ausente de "{0}" com x:Arguments correspondentes.
ru: Отсутствует конструктор для "{0}" с соответствующим x:Arguments.
tr: "{0}" için x:Arguments ile eşleşen oluşturucu eksik.
zh_hans: “{0}”中缺少具有匹配的 x:Arguments 的构造函数。
zh_hant: 缺少符合 x:Arguments 的 "{0}" 建構函式。

# ContentPropertyAttributeMissing
source: Cannot set the content of "{0}" as it doesn't have a [ContentProperty] attribute.
cs: Nejde nastavit obsah typu {0}, protože nemá atribut [ContentProperty].
de: Der Inhalt von "{0}" kann nicht festgelegt werden, weil kein [ContentProperty]-Attribut vorhanden ist.
es: No se puede establecer el contenido de "{0}" porque no tiene un atributo [ContentProperty].
fr: Impossible de définir le contenu de "{0}", car il n'a pas d'attribut [ContentProperty].
it: Non è possibile impostare il contenuto di "{0}" perché non include un attributo [ContentProperty].
ja: [ContentProperty] 属性がないため、"{0}" の内容を設定できません。
ko: "{0}"에 [ContentProperty] 특성이 없기 때문에 내용을 설정할 수 없습니다.
pl: Nie można ustawić zawartości typu „{0}”, ponieważ nie ma on atrybutu [ContentProperty].
pt_br: Não é possível definir o conteúdo de "{0}" porque ele não tem um atributo [ContentProperty].
ru: Не удается задать содержимое "{0}", так как у него нет атрибута [ContentProperty].
tr: "{0}" içeriği, [ContentProperty] özniteliğine sahip olmadığından ayarlanamıyor.
zh_hans: 无法设置“{0}”的内容，因为它没有 [ContentProperty] 属性。
zh_hant: 因為 "{0}" 沒有 [ContentProperty] 屬性，所以無法設定其內容。

# Conversion
source: Cannot convert value "{0}" to "{1}".
cs: Hodnotu {0} nejde převést na typ {1}.
de: Der Wert "{0}" kann nicht in "{1}" konvertiert werden.
es: No se puede convertir el valor "{0}" en "{1}".
fr: Impossible de convertir la valeur "{0}" en "{1}".
it: Non è possibile convertire il valore "{0}" in "{1}".
ja: 値 "{0}" を "{1}" に変換できません。
ko: 값 "{0}"을 "{1}"(으)로 변환할 수 없습니다.
pl: Nie można przekonwertować wartości „{0}” na typ „{1}”.
pt_br: Não é possível converter o valor "{0}" em "{1}".
ru: Не удается преобразовать значение "{0}" в "{1}".
tr: "{0}" değeri "{1}" türüne dönüştürülemiyor.
zh_hans: 无法将值“{0}”转换为“{1}”。
zh_hant: 無法將值 "{0}" 轉換成 "{1}"。

# EnumValueMissing
source: Enum value not found for "{0}".
cs: Pro hodnotu {0} nešlo najít hodnotu výčtu.
de: Der Enumerationswert für "{0}" wurde nicht gefunden.
es: No se encontró el valor de enumeración para "{0}".
fr: Valeur enum introuvable pour "{0}".
it: Valore di enumerazione non trovato per "{0}".
ja: "{0}" の列挙値が見つかりません。
ko: "{0}"에 대한 열거형 값을 찾을 수 없습니다.
pl: Nie znaleziono wartości wyliczenia dla wartości „{0}”.
pt_br: Valor de enumeração não encontrado para "{0}".
ru: Значение перечисления для "{0}" не найдено.
tr: "{0}" için sabit listesi değeri bulunamadı.
zh_hans: 找不到“{0}”的枚举值。
zh_hant: 找不到 "{0}" 的列舉值。

# InvalidXaml
source: Invalid Xaml "{0}".
cs: Neplatný kód XAML: {0}
de: Ungültiger XAML-Codeausschnitt "{0}".
es: XAML no válido "{0}".
fr: Extrait XAML "{0}" non valide.
it: XAML "{0}" non valido.
ja: Xaml "{0}" が無効です。
ko: Xaml "{0}"이(가) 잘못되었습니다.
pl: Nieprawidłowy kod XAML „{0}”.
pt_br: XAML inválido "{0}".
ru: Недопустимый код XAML "{0}".
tr: "{0}" Xaml geçersiz.
zh_hans: Xaml“{0}”无效。
zh_hant: XAML "{0}" 無效。

# MarkupNotClosed
source: Markup expression not closed.
cs: Výraz značky není uzavřený.
de: Der Markupausdruck wurde nicht geschlossen.
es: Expresión de marcado no cerrada.
fr: Expression de balise non fermée.
it: Espressione di markup non chiusa.
ja: マークアップ式が閉じられていません。
ko: 태그 식을 닫지 않았습니다.
pl: Wyrażenie znaczników nie zostało zamknięte.
pt_br: Expressão de marcação não fechada.
ru: Выражение разметки не закрыто.
tr: İşaretleme ifadesi kapatılamadı.
zh_hans: 标记表达式未关闭。
zh_hant: 標記運算式未結束。

# MarkupParsingFailed
source: Error while parsing markup expression.
cs: Při analýze výrazu značky došlo k chybě.
de: Fehler beim Analysieren des Markupausdrucks.
es: Error al analizar la expresión de marcado.
fr: Erreur durant l'analyse de l'expression de balise.
it: Si è verificato un errore durante l'analisi dell'espressione di markup.
ja: マークアップ式の解析中にエラーが発生しました。
ko: 태그 식을 구문 분석하는 동안 오류가 발생했습니다.
pl: Błąd podczas analizowania wyrażenia znaczników.
pt_br: Erro ao analisar a expressão de marcação.
ru: Ошибка при анализе выражения разметки.
tr: İşaretleme ifadesi ayrıştırılırken hata oluştu.
zh_hans: 分析标记表达式时出错。
zh_hant: 剖析標記運算式時發生錯誤。

# MemberResolution
source: No property, BindableProperty, or event found for "{0}", or mismatching type between value and property.
cs: Pro člen {0} nešlo najít žádnou vlastnost, BindableProperty nebo událost nebo došlo k neshodě typu mezi hodnotou a vlastností.
de: Für "{0}" wurde keine Eigenschaft, keine BindableProperty oder kein Ereignis gefunden, oder es gibt eine Typdiskrepanz zwischen Wert und Eigenschaft.
es: No se encontró ninguna propiedad, BindableProperty o evento para "{0}", o el tipo entre el valor y la propiedad no coincide.
fr: Propriété, BindableProperty ou événement introuvable pour "{0}", ou type incompatible entre la valeur et la propriété.
it: Non sono stati trovati eventi, proprietà o elementi BindableProperty per "{0}" oppure il tipo di valore e proprietà non corrispondono.
ja: "{0}" のプロパティ、BindableProperty、またはイベントが見つからないか、値とプロパティの型が一致しません。
ko: "{0}"에 대해 속성, BindableProperty 또는 이벤트를 찾을 수 없거나 값과 속성 간에 형식이 일치하는 않습니다.
pl: Nie znaleziono właściwości BindableProperty lub zdarzenia dla elementu członkowskiego „{0}” lub wartość i właściwość nie są zgodne.
pt_br: Não foi encontrada nenhuma propriedade, nenhuma BindableProperty nem nenhum evento para "{0}". Ou o valor e a propriedade apresentam tipos incompatíveis.
ru: Не найдено свойство, привязываемое свойство (BindableProperty) или событие для "{0}" либо типы значения и свойства не совпадают.
tr: "{0}" için özellik, BindableProperty veya olay bulunamadı ya da değer ile özellik arasındaki tür eşleşmiyor.
zh_hans: 未找到“{0}”的属性、BindableProperty 或事件，或者值与属性之间的类型不匹配。
zh_hant: 找不到 "{0}" 的屬性、BindableProperty 或事件，或值與屬性之間的類型不相符。

# MethodStaticMissing
source: No static method found for "{0}::{1} ({2})".
cs: Pro {0}::{1} ({2}) se nenašla žádná statická metoda.
de: Für "{0}::{1} ({2})" wurde keine statische Methode gefunden.
es: No se encontró ningún método estático para "{0}::{1} ({2})".
fr: Méthode statique introuvable pour "{0}::{1} ({2})".
it: Non è stato trovato alcun metodo statico per "{0}::{1} ({2})".
ja: "{0}::{1} ({2})" の静的メソッドが見つかりません。
ko: "{0}::{1}({2})"에 대한 정적 메서드를 찾을 수 없습니다.
pl: Nie znaleziono żadnej metody statycznej dla elementu „{0}::{1} ({2})”.
pt_br: Não foi encontrado nenhum método estático para "{0}::{1} ({2})".
ru: Не найден статический метод для "{0}::{1} ({2})".
tr: "{0}::{1} ({2})" için statik metot bulunamadı.
zh_hans: 找不到“{0}::{1} ({2})”的静态方法。
zh_hant: 找不到 "{0}::{1} ({2})" 的任何靜態方法。

# MissingEventHandler
source: EventHandler "{0}" with correct signature not found in type "{1}".
cs: V typu {1} nešlo najít obslužnou rutinu událostí {0} se správnou signaturou.
de: Der EventHandler "{0}" mit der richtigen Signatur wurde im Typ "{1}" nicht gefunden.
es: No se encontró el elemento EventHandler "{0}" con la signatura correcta en el tipo "{1}".
fr: Impossible de localiser un EventHandler "{0}" avec une signature correcte dans le type "{1}".
it: Nel tipo "{1}" non è stato trovato alcun elemento EventHandler "{0}" con la firma corretta.
ja: 正しいシグネチャを持つ EventHandler "{0}" が型 "{1}" に見つかりません。
ko: "{1}" 형식에서 올바른 서명이 포함된 EventHandler "{0}"을(를) 찾을 수 없습니다.
pl: W typie „{1}” nie znaleziono programu obsługi zdarzeń „{0}” z poprawnym podpisem.
pt_br: O EventHandler "{0}" com a assinatura correta não foi encontrado no tipo "{1}".
ru: В типе "{1}" не найден обработчик событий (EventHandler) "{0}" с правильной подписью.
tr: "{1}" türünde doğru imzaya sahip "{0}" EventHandler bulunamadı.
zh_hans: 在类型“{1}”中找不到具有正确签名的 EventHandler“{0}”。
zh_hant: 在型別 "{1}" 中找不到具有正確特徵標記的 EventHandler "{0}"。

# NamescopeDuplicate
source: An element with the name "{0}" already exists in this NameScope.
cs: Element s názvem {0} už v tomto oboru názvů existuje.
de: Ein Element mit dem Namen "{0}" ist in diesem NameScope bereits vorhanden.
es: Ya existe un elemento con el nombre "{0}" en este elemento NameScope.
fr: Un élément nommé "{0}" existe déjà dans ce NameScope.
it: In questo elemento NameScope esiste già un elemento denominato "{0}".
ja: この NameScope には、"{0}" という名前の要素が既に存在します。
ko: 이름이 "{0}"인 요소가 이 NameScope에 이미 있습니다.
pl: Element o nazwie „{0}” już istnieje w tym zakresie NameScope.
pt_br: Já existe um elemento com o nome "{0}" neste NameScope.
ru: Элемент с именем "{0}" уже существует в этой области видимости имен.
tr: Bu NameScope içinde "{0}" adlı bir öğe zaten var.
zh_hans: 此 NameScope 中已存在名为“{0}”的元素。
zh_hant: 名稱為 "{0}" 的元素已存在於此 NameScope 中。

# PropertyMissing
source: Missing mandatory property "{0}" on "{1}".
cs: Chybí povinná vlastnost {0} pro typ {1}.
de: Die erforderliche Eigenschaft "{0}" für "{1}" fehlt.
es: Falta la propiedad obligatoria "{0}" en "{1}".
fr: Propriété obligatoire "{0}" manquante sur "{1}".
it: In "{1}" manca la proprietà obbligatoria "{0}".
ja: "{1}" の必須プロパティ "{0}" がありません。
ko: "{1}"에 필수 속성 "{0}"이(가) 없습니다.
pl: Brak obowiązkowej właściwości „{0}” w typie „{1}”.
pt_br: Propriedade obrigatória "{0}" ausente de "{1}".
ru: Отсутствует обязательное свойство "{0}" для "{1}".
tr: "{1}" türünde zorunlu "{0}" özelliği eksik.
zh_hans: “{1}”上缺少强制属性“{0}”。
zh_hant: 在 "{1}" 上缺少強制屬性 "{0}"。

# PropertyResolution
source: Cannot resolve property "{0}" on type "{1} (property missing or missing accessors)".
cs: Nejde přeložit vlastnost {0} pro typ {1} (vlastnost chybí nebo chybí přístupové objekty).
de: Die Eigenschaft "{0}" für den Typ "{1} (Eigenschaft fehlt oder fehlende Accessoren)" kann nicht aufgelöst werden.
es: No se puede resolver la propiedad "{0}" del tipo "{1} (falta la propiedad o faltan los descriptores de acceso)".
fr: Impossible de résoudre la propriété "{0}" sur le type "{1} (propriété manquante ou accesseurs manquants)".
it: Non è possibile risolvere la proprietà "{0}" nel tipo "{1} (funzioni di accesso o proprietà mancanti)".
ja: 型 "{1}" のプロパティ"{0}"を解決できません (プロパティが見つからないか、アクセサーがありません)。
ko: "{1}" 형식에서 속성 "{0}"을(를) 확인할 수 없습니다(속성이 누락되었거나 접근자가 누락됨).
pl: Nie można rozpoznać właściwości „{0}” w typie „{1} (brak właściwości lub brak metod dostępu)”.
pt_br: Não é possível resolver a propriedade "{0}" no tipo "{1} (propriedade ou acessadores ausentes)".
ru: Не удается разрешить свойство "{0}" для типа "{1} (свойство отсутствует или не содержит методов доступа)".
tr: "{1} türündeki "{0}" özelliği çözümlenemiyor (özellik veya erişimciler eksik)".
zh_hans: 无法解析类型“{1}”上的属性“{0}”(缺少属性或访问器)”。
zh_hant: 無法解析型別 "{1}" 上的屬性 "{0}" (缺少屬性或缺少存取子)。

# ResourceDictDuplicateKey
source: "A resource with the key "{0}" is already present in the ResourceDictionary.
cs: Prostředek s klíčem {0} už v ResourceDictionary existuje.
de: "Eine Ressource mit dem Schlüssel "{0}" ist im ResourceDictionary bereits vorhanden.
es: Ya hay un recurso con la clave "{0}" en ResourceDictionary.
fr: "Une ressource avec la clé "{0}" est déjà présente dans ResourceDictionary.
it: "Una risorsa con chiave "{0}" è già presente in ResourceDictionary.
ja: キーが "{0}"のリソースは、ResourceDictionary 内に既に存在します。
ko: 키가 "{0}"인 리소스가 ResourceDictionary에 이미 있습니다.
pl: „Zasób z kluczem „{0}” już znajduje się w elemencie ResourceDictionary.
pt_br: "Um recurso com a chave "{0}" já está presente no ResourceDictionary.
ru: "Ресурс с ключом "{0}" уже присутствует в ResourceDictionary.
tr: "ResourceDictionary içinde "{0}" anahtarına sahip bir kaynak zaten var.
zh_hans: ResourceDictionary 中已存在具有键“{0}”的资源。
zh_hant: 在 ResourceDictionary 中已有金鑰為 "{0}" 的資源。

# ResourceDictMissingKey
source: Resources in ResourceDictionary require a x:Key attribute.
cs: Prostředky v ResourceDictionary vyžadují atribut x:Key.
de: Die Ressourcen im ResourceDictionary erfordern ein x:Key-Attribut.
es: Los recursos de ResourceDictionary requieren un atributo x:Key.
fr: Les ressources de ResourceDictionary nécessitent un attribut x:Key.
it: Per le risorse in ResourceDictionary è richiesto un attributo x:Key.
ja: ResourceDictionary 内のリソースには x:Key 属性が必要です。
ko: ResourceDictionary의 리소스에는 x:Key 특성이 필요합니다.
pl: Zasoby w elemencie ResourceDictionary wymagają atrybutu x:Key.
pt_br: Os recursos no ResourceDictionary exigem um atributo x:Key.
ru: Для ресурсов в ResourceDictionary требуется атрибут x:Key.
tr: ResourceDictionary içindeki kaynaklar için x:Key özniteliği gerekir.
zh_hans: ResourceDictionary 中的资源需具有 x:Key 属性。
zh_hant: ResourceDictionary 中的資源需要 x:Key 屬性。

# ResourceMissing
source: Resource "{0}" not found.
cs: Prostředek {0} se nenašel.
de: Die Ressource "{0}" wurde nicht gefunden.
es: No se encontró el recurso "{0}".
fr: Ressource "{0}" introuvable.
it: La risorsa "{0}" non è stata trovata.
ja: リソース "{0}" が見つかりません。
ko: 리소스 "{0}"을(를) 찾을 수 없습니다.
pl: Nie znaleziono zasobu „{0}”.
pt_br: O recurso "{0}" não foi encontrado.
ru: Ресурс "{0}" не найден.
tr: "{0}" kaynağı bulunamadı.
zh_hans: 找不到资源“{0}”。
zh_hant: 找不到資源 "{0}"。

# SByteEnums
source: Multi-valued enums are not valid on sbyte enum types.
cs: Výčty s více hodnotami nejsou platné pro typy výčtu sbyte.
de: Mehrwertige Enumerationen sind für sbyte-Enumerationstypen ungültig.
es: Las enumeraciones con varios valores no son válidas en los tipos de enumeración SByte.
fr: Les enums à valeurs multiples sont non valides sur les types enum sbyte.
it: Le enumerazioni con valori multipli non sono valide nei tipi enumerazione sbyte.
ja: 複数の値を持つ列挙型は、sbyte 列挙型では無効です。
ko: 다중 값 열거형은 sbyte 열거형 형식에서 사용할 수 없습니다.
pl: Wyliczenia z wieloma wartościami nie są prawidłowe dla typów wyliczeń sbyte.
pt_br: Enumerações com valores múltiplos não são válidas em tipos enumerados sbyte.
ru: Перечисления с несколькими значениями не могут использоваться в типах перечисления sbyte.
tr: Birden çok değere sahip sabit listeleri, sbyte sabit listesi türlerinde geçerli değil.
zh_hans: 多值枚举在 sbyte 枚举类型上无效。
zh_hant: sbyte 列舉類型上，多重值列舉無效。

# StyleSheetNoSourceOrContent
source: StyleSheet require either a Source or a content.
cs: Šablona stylů vyžaduje buď zdroj, nebo obsah.
de: Das StyleSheet erfordert entweder eine Source-Eigenschaft oder einen Inhalt.
es: StyleSheet requiere un origen o un contenido.
fr: StyleSheet nécessite Source ou un contenu.
it: Con l'elemento StyleSheet è richiesto un elemento Source o contenuto.
ja: スタイルシートには、ソースまたはコンテンツのどちらかが必要です。
ko: 스타일 시트에는 원본 또는 콘텐츠가 필요합니다.
pl: Arkusz stylów wymaga źródła albo zawartości.
pt_br: A StyleSheet exige uma Origem ou um conteúdo.
ru: Для таблицы стилей (StyleSheet) необходимо указать источник (Source) или содержимое.
tr: StyleSheet için Source veya içerik gerekir.
zh_hans: 样式表需要源或内容。
zh_hant: 樣式表需要來源或內容。

# StyleSheetSourceNotALiteral
source: Source property is not a string literal.
cs: Zdrojová vlastnost není řetězcový literál.
de: Die Source-Eigenschaft ist kein Zeichenfolgenliteral.
es: La propiedad Source no es un literal de cadena.
fr: La propriété Source n'est pas un littéral de chaîne.
it: La proprietà di origine non è un valore letterale stringa.
ja: ソース プロパティは文字列リテラルではありません。
ko: 원본 속성이 문자열 리터럴이 아닙니다.
pl: Właściwość źródłowa nie jest literałem ciągu.
pt_br: A propriedade de origem não é um literal de cadeia de caracteres.
ru: Свойство Source не является строковым литералом.
tr: Kaynak özelliği bir dize sabit değeri değil.
zh_hans: 源属性不是字符串文本。
zh_hant: 來源屬性不是字串常值。
